src/cf/InformationRegisters/вогСтатусыОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСтатусыОпросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогШаблоныСтатусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Анкета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.вогВариантыОпросов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОпроса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогВариантыОпросов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ЗадачиПоИсправлениюКлиентскойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗадачиПоИсправлениюКлиентскойБазы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыМастераПроверкиКлиентскойБазы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПартнерРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/bpmТипыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>bpmТипыПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцессОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимыйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/CRM_Интерес.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Интерес</Name>
			<Comment>Интерес</Comment>
			<BasedOn>
				<xr:Item>Document.CRM_Интерес</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВероятностьСделки</Name>
					<Comment>Вероятность сделки в процентах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоДействия</Name>
					<Comment>Дата следующего действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_РассылкаЭлектронныхПисем</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложениеКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_СообщениеМессенджера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяВыручка</Name>
					<Comment>Ожидаемая выручка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Comment>Офис подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Comment>Партнер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение ответственного</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКлиент</Name>
					<Comment>Потенциальный клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Comment>Причина отказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныОтказаПоИнтересам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Comment>Тип услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Comment>Состояние интереса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Тема документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующееДействиеПредставление</Name>
					<Comment>Служебный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Избранный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CRM_Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/CRM_МетодыМодулейМенеджеровЗадач/Ext/Module.bsl
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.

// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область ОпределениеФормОбъектов

Процедура ОбработкаПолученияФормОбъектовCRM(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ЗадачаМенеджер.ЗадачаИсполнителя") Тогда
		
		Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
			Если НЕ ЗначениеЗаполнено(Параметры.Ключ.БизнесПроцесс) Тогда
				
				// ++ VOG Солодов В.В. 05.09.2019 task 605
				МассивПользователей = Новый Массив;
				МассивПользователей.Добавить(Параметры.Ключ.Исполнитель);
				
				ЭтоДелегат = РегистрыСведений.вогИсполнителиРолейИДелегаты.ИсполнительЯвляетсяДелегатом(
					МассивПользователей,
					Пользователи.ТекущийПользователь(),
					"Анкеты");
				// -- VOG Солодов В.В. 05.09.2019
				
				Если (Параметры.Ключ.Исполнитель = Пользователи.ТекущийПользователь() Или ЭтоДелегат) // VOG Солодов В.В. 05.09.2019 task 605 // Добавлено Или ЭтоДелегат
					И ТипЗнч(Параметры.Ключ.Предмет) = Тип("ДокументСсылка.вогАнкета") Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	вогСтатусыОпросов.Анкета КАК Анкета
					|ИЗ
					|	РегистрСведений.вогСтатусыОпросов КАК вогСтатусыОпросов
					|ГДЕ
					|	вогСтатусыОпросов.Анкета = &Анкета";
					
					Запрос.УстановитьПараметр("Анкета",Параметры.Ключ.Предмет);
					
					Результат = Запрос.Выполнить();
					
					Если Результат.Пустой() Тогда
						ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи";
					Иначе 	
						Параметры.Ключ = Параметры.Ключ.Предмет;
						ВыбраннаяФорма = "Документ.вогАнкета.Форма.ФормаДокумента";
					КонецЕсли; 
					
				Иначе 	
					ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи";	
				КонецЕсли; 
				
				СтандартнаяОбработка = Ложь;
				
			ИначеЕсли ЗначениеЗаполнено(Параметры.Ключ.БизнесПроцесс)
				И ТипЗнч(Параметры.Ключ.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
				
				СтандартнаяОбработка = Ложь;
				//+вог
				//ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи";
				//Возврат;
				//-вог
				Если РегистрыСведений.CRM_ЗадачиПоИсправлениюКлиентскойБазы.ЭтоЗадачаПоИсправлениюКлиентскойБазы(Параметры.Ключ) <> Неопределено Тогда
					ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи";
					// ++ Тищенко В.В. 14.02.2019
					// Если это поручение открывать форму задачи
					// Добавлено условие
					// И Параметры.Ключ.БизнесПроцесс.КартаМаршрута <> Справочники.CRM_КартыМаршрутов.Поручение 
				ИначеЕсли Параметры.Ключ.БизнесПроцесс.КартаМаршрута.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс 
					И Параметры.Ключ.БизнесПроцесс.КартаМаршрута <> Справочники.CRM_КартыМаршрутов.Поручение
					И Параметры.Ключ.БизнесПроцесс.КартаМаршрута <> Справочники.CRM_КартыМаршрутов.ПоручениеГрупповое // ++ VOG Солодов В.В. 21.08.2019 task 477 // добавил условие
					И Параметры.Ключ.БизнесПроцесс.КартаМаршрута <> Справочники.CRM_КартыМаршрутов.ПоручениеНовое Тогда // ++ VOG Солодов В.В. 31.07.2020 task 792 // добавил условие
					
					// ++ VOG Солодов В.В. 19.08.2019
					Предмет = Параметры.Ключ.БизнесПроцесс.Предмет;
					
					Если ТипЗнч(Предмет) = Тип("ДокументСсылка.вогАнкета")
						И Не РольДоступна("ПолныеПрава")
						И Предмет.ВариантОпроса.ИспользоватьФормуАнкетыВЗадаче Тогда
						Параметры.Ключ = Параметры.Ключ.БизнесПроцесс.Предмет;
						ВыбраннаяФорма = "Документ.вогАнкета.Форма.ФормаДокумента";
					Иначе
						ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачиНезависимыйПроцесс";
					КонецЕсли;
					// До изменения
					//ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачиНезависимыйПроцесс";
					// -- VOG Солодов В.В. 19.08.2019
					// -- Тищенко В.В. 
				ИначеЕсли Параметры.Ключ.БизнесПроцесс.КартаМаршрута.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта
					И ЗначениеЗаполнено(Параметры.Ключ.БизнесПроцесс.Интерес) 
					И (ТипЗнч(Параметры.Ключ.БизнесПроцесс.Интерес) = Тип("ДокументСсылка.CRM_Интерес"))
					И ЗначениеЗаполнено(Параметры.Ключ.CRM_СостояниеИнтереса)
					И (Параметры.Ключ.БизнесПроцесс.Интерес.Ответственный = Параметры.Ключ.Исполнитель) Тогда
					Параметры.Ключ = Параметры.Ключ.БизнесПроцесс.Интерес;
					ВыбраннаяФорма = "Документ.CRM_Интерес.ФормаОбъекта";
				ИначеЕсли Параметры.Ключ.БизнесПроцесс.КартаМаршрута.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта
					И ЗначениеЗаполнено(Параметры.Ключ.БизнесПроцесс.Интерес)
					И ЗначениеЗаполнено(Параметры.Ключ.CRM_СостояниеИнтереса) Тогда
					Параметры.Ключ = Параметры.Ключ.БизнесПроцесс.Интерес;
					ИсточникНов = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Параметры.Ключ);
					CRM_МетодыМодулейМенеджеровДокументов.ОбработкаПолученияФормОбъектовCRM(ИсточникНов, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
				// ++ VOG Солодов В.В. 17.08.2020 CRM-827
				ИначеЕсли Параметры.Ключ.БизнесПроцесс.КартаМаршрута = Справочники.CRM_КартыМаршрутов.ПоручениеНовое Тогда
					
					// ++ VOG Солодов В.В. 01.06.2021 DEV-608
					ВыбраннаяФорма = вогБизнесПроцессыИЗадачиСервер.ОпределитьФормуЗадачи(Параметры.Ключ);
					// До изменения
					// ++ VOG Солодов В.В. 01.06.2021 DEV-601
					//ТочкиКонтроля = Новый Массив;
					//ТочкиКонтроля.Добавить("Действие2");
					//ТочкиКонтроля.Добавить("Действие3");
					//ТочкиКонтроля.Добавить("Действие4");
					//// -- VOG Солодов В.В. 01.06.2021 DEV-601
					//
					//РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					//	Параметры.Ключ,
					//	"БизнесПроцесс, Исполнитель, Выполнена, ПринятаКИсполнению, CRM_ТочкаМаршрута",
					//	Истина);
					//
					//РеквизитыБП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					//	РеквизитыЗадачи.БизнесПроцесс,
					//	"Автор, Ответственный",
					//	Истина);
					//
					//ТекущийПользователь = Пользователи.ТекущийПользователь();
					//
					//МассивАвторов = Новый Массив;
					//МассивАвторов.Добавить(РеквизитыБП.Автор);
					//МассивАвторов.Добавить(РеквизитыБП.Ответственный);
					//// ++ VOG Солодов В.В. 01.06.2021 DEV-601
					//Если Не ТочкиКонтроля.Найти(РеквизитыЗадачи.CRM_ТочкаМаршрута.Имя) = Неопределено Тогда
					//	МассивАвторов.Добавить(РеквизитыЗадачи.Исполнитель);
					//КонецЕсли;
					//// -- VOG Солодов В.В. 01.06.2021 DEV-601
					//
					//ПользовательЯвляетсяДелегатом = РегистрыСведений.вогИсполнителиРолейИДелегаты.ИсполнительЯвляетсяДелегатом(
					//	МассивАвторов,
					//	ТекущийПользователь,
					//	"ПроцессыИЗадачи",
					//	// ++ VOG Солодов В.В. 23.12.2020 DEV-44
					//	Ложь);
					//	// До изменения
					//	//Истина);
					//	// -- VOG Солодов В.В. 23.12.2020 DEV-44
					//
					//Если ТекущийПользователь = РеквизитыБП.Автор
					//	Или ТекущийПользователь = РеквизитыБП.Ответственный
					//	Или ПользовательЯвляетсяДелегатом Тогда
					//	
					//	Если ТекущийПользователь = РеквизитыЗадачи.Исполнитель
					//		И Не РеквизитыЗадачи.Выполнена
					//		И РеквизитыЗадачи.ПринятаКИсполнению
					//		// ++ VOG Солодов В.В. 01.06.2021 DEV-601
					//		И ТочкиКонтроля.Найти(РеквизитыЗадачи.CRM_ТочкаМаршрута.Имя) = Неопределено Тогда
					//		// До изменения
					//		//И Не РеквизитыЗадачи.CRM_ТочкаМаршрута.Имя = "Действие2"
					//		//И Не РеквизитыЗадачи.CRM_ТочкаМаршрута.Имя = "Действие3"
					//		//И Не РеквизитыЗадачи.CRM_ТочкаМаршрута.Имя = "Действие4" Тогда
					//		// -- VOG Солодов В.В. 01.06.2021 DEV-601
					//		
					//		ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи";
					//		
					//	Иначе
					//		ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.вогМониторИсполненияПоручения";
					//	КонецЕсли;
					//	
					//Иначе
					//	
					//	Запрос = Новый Запрос;
					//	Запрос.Текст = 
					//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					//	|	CRM_БизнесПроцесс.Ссылка КАК Ссылка
					//	|ИЗ
					//	|	РегистрСведений.вогСписокИсполнителейПоручения КАК вогСписокИсполнителейПоручения
					//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
					//	|		ПО вогСписокИсполнителейПоручения.БизнесПроцесс = CRM_БизнесПроцесс.Ссылка
					//	|			И (вогСписокИсполнителейПоручения.Контролер = ИСТИНА)
					//	|			И (вогСписокИсполнителейПоручения.Исполнитель В(&Пользователи))
					//	|			И (CRM_БизнесПроцесс.Ссылка = &БизнесПроцесс)";
					//	
					//	Если Не ПользовательЯвляетсяДелегатом Тогда
					//		МассивАвторов = Новый Массив;
					//	КонецЕсли;
					//	
					//	МассивАвторов.Добавить(ТекущийПользователь);
					//	
					//	Запрос.УстановитьПараметр("Пользователи", 	МассивАвторов);
					//	Запрос.УстановитьПараметр("БизнесПроцесс", 	РеквизитыЗадачи.БизнесПроцесс);
					//	
					//	РезультатЗапроса = Запрос.Выполнить();
					//	
					//	Если РезультатЗапроса.Пустой() Тогда
					//		ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи";
					//	Иначе
					//		ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.вогМониторИсполненияПоручения";
					//	КонецЕсли;
					//	
					//КонецЕсли;
					// -- VOG Солодов В.В. 01.06.2021 DEV-608
					
				Иначе
					ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи_Старая";
				// До Изменения
				//Иначе
				//	ВыбраннаяФорма = "БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачи";
				// -- VOG Солодов В.В. 17.08.2020 CRM-827
				КонецЕсли;
			ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
				ПараметрыФормы = БизнесПроцессыИЗадачиВызовСервера.ФормаВыполненияЗадачи(Параметры.Ключ);
				ИмяФормыЗадачи = "";
				Результат = ПараметрыФормы.Свойство("ИмяФормы", ИмяФормыЗадачи);
				Если Результат Тогда
					ВыбраннаяФорма = ИмяФормыЗадачи;
					СтандартнаяОбработка = Ложь;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
			Если Параметры.Свойство("Основание") И (ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.УдалитьCRM_Событие")
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.CRM_КонтрольнаяТочкаПроекта") 
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.МаркетинговыеМероприятия")
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.CRM_Телемаркетинг"))
				ИЛИ ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.CRM_СообщениеМессенджера")
				Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи";
			КонецЕсли;
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаСписка";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов
